[
    {
        "Title": "title of the search 1",
        "url": "http://stackoverflow.com/questions/24349731/dynamically-set-the-value-of-ui-sref-angularjs",
        "description": "Prometheus is a 2012 American science fiction film directed by Ridley Scott (pictured), written by Jon Spaihts and Damon Lindelof, and starring Noomi Rapace, Michael Fassbender, Guy Pearce, Idris Elba, Logan Marshall-Green, and Charlize Theron. In the late 21st century, the crew of Prometheus follows a star map seeking the origins of humanity; they arrive on a distant world and discover a threat that could cause the extinction of the human race. The film was initially conceived as a prequel to the Alien franchise. In late 2010 Lindelof and Scott rewrote a Spaihts script relying on the Alien universe, but exploring its own mythology and ideas. Principal photography began in March 2011, with an estimated $120–130 million budget. The film was released in 2012 in Britain and North America, and grossed over $403 million worldwide. Reviews praised the film's visual aesthetic design and the acting, especially Fassbender's performance as the android David. The plot drew a mixed response from critics, who faulted elements that remained unresolved or were predictable. A sequel, Alien: Covenant, is scheduled to be released in August 2017. (Full article...) Fifty-seven tornadoes touched down across eight states in a moderate tornado outbreak spawned by Hurricane Katrina's outer bands. The event spanned August 26–31, 2005. Due to extreme devastation in coastal areas of Louisiana and Mississippi, multiple tornadoes may have been overlooked—overshadowed by the effects of storm surge and large-scale wind—and thus the full extent of the hurricane's tornado outbreak is uncertain. The outbreak began with an isolated F2 over the Florida Keys on August 26; no tornadoes were recorded the following day as the storm traversed the Gulf of Mexico. Four weak tornadoes were observed on August 28 as the hurricane approached land, each causing little damage. Coincident with Katrina's landfall, activity began in earnest on August 29 with numerous tornadoes touching down across Gulf Coast states. Georgia suffered the greatest impact on this day, with multiple F1 and F2 tornadoes causing significant damage; one person died in Carroll County, marking the first known instance of a tornado-related death in the state during August. (Full list...)"
    },
    {
        "Title": "title of the search 2",
        "url": "https://rclayton.silvrback.com/passing-state-via-routes",
        "description": "Wikipedia (Loudspeaker.png pronunciation (info • help)) is an Internet encyclopedia project in many languages. It is free of charge: users do not pay. But they can choose to donate to the Wikimedia Foundation to fund Wikipedia and her sister projects. It is 'open content'. This means anyone can copy it, and make changes to it if they follow the rules for copying or editing. Wikipedia is owned by an American organization, Wikimedia Foundation, which is in San Francisco, California. Its name is a combination of the two words wiki, a Hawaiian word for quick, and encyclopedia.[3] Because the word was made by combining parts of those words, it is a portmanteau. It was started on January 10, 2001 by Jimmy Wales and Larry Sanger as part of an earlier Internet encyclopedia named Nupedia. On January 15, 2001, Wikipedia became a separate website of its own. It is a wiki that runs using the software MediaWiki (like all other Wikimedia projects). Anyone who wishes to, can change the pages in Wikipedia, or even make new ones. Wikipedia has a standard page layout for all pages in the encyclopedia. As of December 2007, Wikipedia had about 9.25 million pages in 253 languages, and more than 1.74 billion words across all Wikipedias. The English Wikipedia is the biggest."
    },
    {
        "Title": "title of the search 3",
        "url": "https://github.com/angular-ui/ui-router/issues/395",
        "description": "Wikipedia began as a related project for Nupedia. Nupedia was a free online English-language encyclopedia project. Nupedia's articles were written and owned by Bomis, Inc which is a web portal company. The main people of the company were Jimmy Wales, the guy in charge of Bomis, and Larry Sanger, the editor-in-chief for Nupedia. Nupedia was first licensed under the Nupedia Open Content License which was changed to the GNU Free Documentation License before Wikipedia was founded when Richard Stallman requested them.[4]The Wikipedia Monument, October 2014 Larry Sanger and Jimmy Wales are the ones who started Wikipedia.[5][6] Wales is credited with defining the goals of the project.[7][8] Sanger created the strategy of using a wiki to reach Wales' goal.[9] On January 10, 2001, Larry Sanger proposed on the Nupedia mailing list to create a wiki as a 'feeder' project for Nupedia.[10] Wikipedia was launched on January 15, 2001. It was launched as an English-language edition at www.wikipedia.com,[11] and announced by Sanger on the Nupedia mailing list.[7] Wikipedia's policy of 'neutral point-of-view'[12] was codified in its initial months, and was similar to Nupedia's earlier 'nonbiased' policy. Otherwise, there were not very many rules initially, and Wikipedia operated independently of Nupedia.[7] Wikipedia gained early contributors from Nupedia, Slashdot, and also from search engines. It grew to about 20,000 articles, and 18 languages by the end of 2001. By late 2002 it had 26 languages, 46 by the end of 2003, and 161 by the end of 2004.[13] Nupedia and Wikipedia both existed until Nupedia's servers were stopped in 2003. After this, its text was incorporated into Wikipedia. The English Wikipedia passed the 2 million-article mark on September 9, 2007, making it the largest encyclopedia ever assembled, even larger than the Yongle Encyclopedia (1407), which had held the record for exactly 600 years.[14]"
    }
]